src/Documents/ImportedProducts/ImportedProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ImportedProducts</name>
  <registerRecords>AccumulationRegister.RemainingProducts</registerRecords>
  <attributes>
    <name>Storage</name>
    <type>
      <types>EnumRef.Storage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Nomenclature</name>
      <type>
        <types>CatalogRef.Nomenclature</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/NomenclaturePrice/NomenclaturePrice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>NomenclaturePrice</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Nomenclature</name>
    <type>
      <types>CatalogRef.Nomenclature</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ImportedProducts/Forms/DocumentForm/Module.bsl
&AtClient
Procedure ProductNomenclatureOnChange(Item)
	line = Items.Products.CurrentData; 
	line.Price = ProductNomenclatureOnChangeAtServer(line.Nomenclature);
EndProcedure

&AtServer
Function ProductNomenclatureOnChangeAtServer(Val Nomenclature)
	StructureNomen = new Structure("Nomenclature", Nomenclature);
	res = InformationRegisters.NomenclaturePrice.GetLast(CurrentDate(), StructureNomen);
	Return res.Price;
EndFunction
